vrmay23/port_nucleo-h753zi/nuttx/boards/arm/stm32h7/nucleo-h753zi/src/drivers/driver_bus/stm32_spi_new.c
  if (pin_str[0] != 'P')
    {
      *error = -EINVAL;
      return 0;
    }

  port = pin_str[1];
  if (port < 'A' || port > 'H') /* STM32H753ZI only has ports A-H */
    {
      *error = -EINVAL;
      return 0;
    }

  pin_num_str = &pin_str[2];
  pin_num = strtol(pin_num_str, &endptr, 10);
  if (*endptr != '\0' || pin_num < 0 || pin_num > 15)
    {
      *error = -EINVAL;
      return 0;
    }

  /* Map port letter to STM32 port base */
  switch (port)
    {
      case 'A': port_base = GPIO_PORTA; break;
      case 'B': port_base = GPIO_PORTB; break;
      case 'C': port_base = GPIO_PORTC; break;
      case 'D': port_base = GPIO_PORTD; break;
      case 'E': port_base = GPIO_PORTE; break;
      case 'F': port_base = GPIO_PORTF; break;
      case 'G': port_base = GPIO_PORTG; break;
      case 'H': port_base = GPIO_PORTH; break;
      default:
        *error = -EINVAL;
        return 0;
    }

  /* Use correct STM32 GPIO pin macros */
  switch (pin_num)
    {
      case 0:  gpio_pin = GPIO_PIN0;  break;
      case 1:  gpio_pin = GPIO_PIN1;  break;
      case 2:  gpio_pin = GPIO_PIN2;  break;
      case 3:  gpio_pin = GPIO_PIN3;  break;
      case 4:  gpio_pin = GPIO_PIN4;  break;
      case 5:  gpio_pin = GPIO_PIN5;  break;
      case 6:  gpio_pin = GPIO_PIN6;  break;
      case 7:  gpio_pin = GPIO_PIN7;  break;
      case 8:  gpio_pin = GPIO_PIN8;  break;
      case 9:  gpio_pin = GPIO_PIN9;  break;
      case 10: gpio_pin = GPIO_PIN10; break;
      case 11: gpio_pin = GPIO_PIN11; break;
      case 12: gpio_pin = GPIO_PIN12; break;
      case 13: gpio_pin = GPIO_PIN13; break;
      case 14: gpio_pin = GPIO_PIN14; break;
      case 15: gpio_pin = GPIO_PIN15; break;
      default:
        *error = -EINVAL;
        return 0;
    }

  return (GPIO_OUTPUT | GPIO_OUTPUT_SET | GPIO_SPEED_50MHz | port_base | gpio_pin);
}

/****************************************************************************
 * Name: get_cs_devices_array
 *
 * Description:
 * Get CS devices array for a specific SPI bus.
 *
 * Input Parameters:
 * spi_bus - SPI bus number (1-6)
 *
 * Returned Value:
 * Pointer to CS devices array, NULL if invalid bus
 *
 ****************************************************************************/

static struct spi_cs_device_s *get_cs_devices_array(int spi_bus)
{
  switch (spi_bus)
    {
#ifdef CONFIG_STM32H7_SPI1
      case 1: return g_spi1_cs_devices;
#endif
#ifdef CONFIG_STM32H7_SPI2
      case 2: return g_spi2_cs_devices;
#endif
#ifdef CONFIG_STM32H7_SPI3
      case 3: return g_spi3_cs_devices;
#endif
#ifdef CONFIG_STM32H7_SPI4
      case 4: return g_spi4_cs_devices;
#endif
#ifdef CONFIG_STM32H7_SPI5
      case 5: return g_spi5_cs_devices;
#endif
#ifdef CONFIG_STM32H7_SPI6
      case 6: return g_spi6_cs_devices;
#endif
      default:
        return NULL;
    }
}

/****************************************************************************
 * Name: spi_cs_control
 *
 * Description:
 * Control SPI chip select pin based on registered device.
 * Now includes fallback for invalid device IDs.
 *
 * Input Parameters:
 * spi_bus  - SPI bus number (1-6)
 * devid    - Device ID within the bus
 * selected - Select (true) or deselect (false)
 *
 ****************************************************************************/

static void spi_cs_control(int spi_bus, uint32_t devid, bool selected)
{
  struct spi_cs_device_s *cs_devices;
  struct spi_cs_device_s *device;
  bool pin_state;
  uint32_t actual_devid = devid;

  cs_devices = get_cs_devices_array(spi_bus);
  if (cs_devices == NULL)
    {
      spierr("ERROR: Invalid SPI bus %d\n", spi_bus);
      return;
    }

  /* FIX: Compatibility with NuttX SPIDEV_* types (e.g., SPIDEV_CONTACTLESS).
   * These types use the upper 16 bits for device classification and the lower
   * 16 bits for the device index. This fix extracts the real device ID from
   * the lower 16 bits to make it compatible with the board's CS registration
   * system (which expects IDs from 0-15). This prevents the system from
   * always falling back to device ID 0 for these drivers.
   */
  if ((devid & 0xFFFF0000) != 0)
    {
      actual_devid = (devid & 0x0000FFFF);
      spiinfo("Detected SPIDEV type 0x%04lX, using index %lu for SPI%d\n",
              (unsigned long)(devid >> 16), (unsigned long)actual_devid, spi_bus);
    }
  /* FALLBACK: If device ID is invalid, try to use device ID 0 as fallback */
  else if (devid >= MAX_CS_DEVICES_PER_SPI)
    {
      spiwarn("WARNING: Device ID %lu >= maximum %d for SPI%d, trying fallback to ID 0\n",
             (unsigned long)devid, MAX_CS_DEVICES_PER_SPI, spi_bus);
      
      /* Check if device ID 0 is registered */
      if (cs_devices[0].in_use)
        {
          actual_devid = 0;
          spiinfo("SUCCESS: Using fallback device ID 0 for invalid ID %lu\n", 
                  (unsigned long)devid);
        }
      else
        {
          spierr("ERROR: Device ID %lu >= maximum %d and no fallback available for SPI%d\n",
                 (unsigned long)devid, MAX_CS_DEVICES_PER_SPI, spi_bus);
          return;
        }
    }

  device = &cs_devices[actual_devid];
  if (!device->in_use)
    {
      spierr("ERROR: Device ID %lu (actual %lu) not registered for SPI%d\n",
             (unsigned long)devid, (unsigned long)actual_devid, spi_bus);
      return;
    }

  /* Calculate pin state based on active level and selection */
  if (device->active_low)
    {
      pin_state = !selected;  /* Active low: select=low, deselect=high */
    }
  else
    {
      pin_state = selected;   /* Active high: select=high, deselect=low */
    }

  stm32_gpiowrite(device->gpio_config, pin_state);

  spiinfo("SPI%d CS%lu->%lu: %s (pin %s)\n", 
          spi_bus, (unsigned long)devid, (unsigned long)actual_devid,
          selected ? "SELECT" : "DESELECT",
          pin_state ? "HIGH" : "LOW");
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_spi_initialize
 *
 * Description:
 * Initialize SPI interfaces. CS pins are now managed per-sensor.
 *
 * Returned Value:
 * OK on success, negative errno on error
 * 
 * memset ---> do the same as: fill_out_with_zeroes(MAX_CS_DEVICES_PER_SPI)
 * 
 * 
 * fill_out_with_zeroes(MAX_CS_DEVICES_PER_SPI){
 *    for (int i = 0; i < MAX_CS_DEVICES_PER_SPI; i++)
 *    {
 *     g_spi1_cs_devices[i].gpio_config = 0;
 *     g_spi1_cs_devices[i].active_low = false;
 *     g_spi1_cs_devices[i].in_use = false;
 *    }
 * }
 *
 ****************************************************************************/

int stm32_spi_initialize(void)
{
  spiinfo("stm32_spi_initialize: Initializing SPI interfaces\n");

  /* Initialize CS device arrays to empty/unused state */

#ifdef CONFIG_STM32H7_SPI1
  memset(g_spi1_cs_devices, 0, sizeof(g_spi1_cs_devices));
#ifdef CONFIG_SPI_CMDDATA
  memset(g_spi1_dc_devices, 0, sizeof(g_spi1_dc_devices));
#endif
  spiinfo("SPI1 CS/DC registry initialized\n");
#endif

#ifdef CONFIG_STM32H7_SPI2
  memset(g_spi2_cs_devices, 0, sizeof(g_spi2_cs_devices));
#ifdef CONFIG_SPI_CMDDATA
  memset(g_spi2_dc_devices, 0, sizeof(g_spi2_dc_devices));
#endif
  spiinfo("SPI2 CS/DC registry initialized\n");
#endif

#ifdef CONFIG_STM32H7_SPI3
  memset(g_spi3_cs_devices, 0, sizeof(g_spi3_cs_devices));
#ifdef CONFIG_SPI_CMDDATA
  memset(g_spi3_dc_devices, 0, sizeof(g_spi3_dc_devices));
#endif
  spiinfo("SPI3 CS/DC registry initialized\n");
#endif

