vrmay23/port_nucleo-h753zi/nuttx/boards/arm/stm32h7/nucleo-h753zi/src/drivers/driver_bus/stm32_spi_new.c
#ifdef CONFIG_STM32H7_SPI4
  memset(g_spi4_cs_devices, 0, sizeof(g_spi4_cs_devices));
#ifdef CONFIG_SPI_CMDDATA
  memset(g_spi4_dc_devices, 0, sizeof(g_spi4_dc_devices));
#endif
  spiinfo("SPI4 CS/DC registry initialized\n");
#endif

#ifdef CONFIG_STM32H7_SPI5
  memset(g_spi5_cs_devices, 0, sizeof(g_spi5_cs_devices));
#ifdef CONFIG_SPI_CMDDATA
  memset(g_spi5_dc_devices, 0, sizeof(g_spi5_dc_devices));
#endif
  spiinfo("SPI5 CS/DC registry initialized\n");
#endif

#ifdef CONFIG_STM32H7_SPI6
  memset(g_spi6_cs_devices, 0, sizeof(g_spi6_cs_devices));
#ifdef CONFIG_SPI_CMDDATA
  memset(g_spi6_dc_devices, 0, sizeof(g_spi6_dc_devices));
#endif
  spiinfo("SPI6 CS/DC registry initialized\n");
#endif

  spiinfo("SPI initialization completed\n");
  return OK;
}

/****************************************************************************
 * Name: stm32_spi_register_cs_device
 *
 * Description:
 * Register a CS device for a specific SPI bus and device ID.
 *
 * Input Parameters:
 * spi_bus     - SPI bus number (1-6)
 * devid       - Device ID (0 to MAX_CS_DEVICES_PER_SPI-1)
 * cs_pin      - CS pin string (e.g., "PF1")
 * active_low  - true if CS is active low, false if active high
 *
 * Returned Value:
 * OK on success, negative errno on error
 *
 ****************************************************************************/

int stm32_spi_register_cs_device(int spi_bus, uint32_t devid, 
                                  const char *cs_pin, bool active_low)
{
  struct spi_cs_device_s *cs_devices;
  struct spi_cs_device_s *device;
  uint32_t gpio_config;
  int error;
  int ret;

  /* Validate parameters */
  cs_devices = get_cs_devices_array(spi_bus);
  if (cs_devices == NULL)
    {
      spierr("ERROR: Invalid SPI bus %d\n", spi_bus);
      return -EINVAL;
    }

  if (devid >= MAX_CS_DEVICES_PER_SPI)
    {
      spierr("ERROR: Device ID %lu >= maximum %d\n",
             (unsigned long)devid, MAX_CS_DEVICES_PER_SPI);
      return -EINVAL;
    }

  device = &cs_devices[devid];
  if (device->in_use)
    {
      spierr("ERROR: Device ID %lu already registered for SPI%d\n",
             (unsigned long)devid, spi_bus);
      return -EBUSY;
    }

  /* Parse CS pin */
  gpio_config = parse_gpio_pin(cs_pin, &error);
  if (error != 0)
    {
      spierr("ERROR: Invalid CS pin '%s': %d\n", cs_pin, error);
      return error;
    }

  /* Configure GPIO pin */
  ret = stm32_configgpio(gpio_config);
  if (ret < 0)
    {
      spierr("ERROR: Failed to configure CS pin %s: %d\n", cs_pin, ret);
      return ret;
    }

  /* Initialize CS pin to deselected state */
  stm32_gpiowrite(gpio_config, active_low ? true : false);

  /* Register device */
  device->gpio_config = gpio_config;
  device->active_low = active_low;
  device->in_use = true;

  spiinfo("Registered SPI%d device %lu: pin %s (%s)\n",
          spi_bus, (unsigned long)devid, cs_pin, 
          active_low ? "active_low" : "active_high");

  return OK;
}

/****************************************************************************
 * Name: stm32_spi_register_dc_pin
 *
 * Description:
 *   Register a DC (Data/Command) pin for a specific SPI device.
 *   This enables SPI_CMDDATA functionality for displays like ST7796.
 *
 * Input Parameters:
 *   spi_bus - SPI bus number (1-6)
 *   devid   - Device ID (0 to MAX_CS_DEVICES_PER_SPI-1)
 *   dc_pin  - DC pin string (e.g., "PA3")
 *
 * Returned Value:
 *   OK on success, negative errno on error
 *
 ****************************************************************************/

#ifdef CONFIG_SPI_CMDDATA
int stm32_spi_register_dc_pin(int spi_bus, uint32_t devid,
                               const char *dc_pin)
{
  struct spi_dc_device_s *dc_devices;
  struct spi_dc_device_s *device;
  uint32_t gpio_config;
  int error;
  int ret;

  /* Validate parameters */

  dc_devices = get_dc_devices_array(spi_bus);
  if (dc_devices == NULL)
    {
      spierr("ERROR: Invalid SPI bus %d\n", spi_bus);
      return -EINVAL;
    }

  if (devid >= MAX_CS_DEVICES_PER_SPI)
    {
      spierr("ERROR: Device ID %lu >= maximum %d\n",
             (unsigned long)devid, MAX_CS_DEVICES_PER_SPI);
      return -EINVAL;
    }

  device = &dc_devices[devid];
  if (device->in_use)
    {
      spierr("ERROR: DC pin already registered for SPI%d device %lu\n",
             (unsigned long)devid, spi_bus);
      return -EBUSY;
    }

  /* Parse DC pin */

  gpio_config = parse_gpio_pin(dc_pin, &error);
  if (error != 0)
    {
      spierr("ERROR: Invalid DC pin '%s': %d\n", dc_pin, error);
      return error;
    }

  /* Configure GPIO pin as output */

  ret = stm32_configgpio(gpio_config);
  if (ret < 0)
    {
      spierr("ERROR: Failed to configure DC pin %s: %d\n", dc_pin, ret);
      return ret;
    }

  /* Initialize DC pin to data mode (LOW) */

  stm32_gpiowrite(gpio_config, false);

  /* Register device */

  device->gpio_config = gpio_config;
  device->in_use = true;

  spiinfo("Registered SPI%d device %lu DC pin: %s\n",
          spi_bus, (unsigned long)devid, dc_pin);

  return OK;
}
#endif /* CONFIG_SPI_CMDDATA */

/****************************************************************************
 * Name: stm32_spi_unregister_cs_device
 *
 * Description:
 * Unregister a CS device.
 *
 * Input Parameters:
 * spi_bus - SPI bus number (1-6)
 * devid   - Device ID
 *
 * Returned Value:
 * OK on success, negative errno on error
 *
 ****************************************************************************/

int stm32_spi_unregister_cs_device(int spi_bus, uint32_t devid)
{
  struct spi_cs_device_s *cs_devices;
  struct spi_cs_device_s *device;

  cs_devices = get_cs_devices_array(spi_bus);
  if (cs_devices == NULL)
    {
      return -EINVAL;
    }

  if (devid >= MAX_CS_DEVICES_PER_SPI)
    {
      return -EINVAL;
    }

  device = &cs_devices[devid];
  if (!device->in_use)
    {
      return -ENOENT;
    }

  /* Clear device registration */
  device->gpio_config = INVALID_CS_PIN;
  device->active_low = false;
  device->in_use = false;

  spiinfo("Unregistered SPI%d device %lu\n", spi_bus, (unsigned long)devid);
  return OK;
}

/****************************************************************************
 * Name: stm32_spidev_register_all
 *
 * Description:
 * Register SPI devices for user access via /dev/spiN.
 *
 ****************************************************************************/

#ifdef CONFIG_SPI_DRIVER
int stm32_spidev_register_all(void)
{
  int ret = OK;

#ifdef CONFIG_STM32H7_SPI1
  FAR struct spi_dev_s *spi1;
  
  spi1 = stm32_spibus_initialize(1);
  if (spi1)
    {
      ret = spi_register(spi1, 1);
      if (ret < 0)
        {
          syslog(LOG_ERR, "ERROR: Failed to register SPI1: %d\n", ret);
        }
      else
        {
          syslog(LOG_INFO, "SPI1 registered as /dev/spi1\n");
        }
    }
#endif

#ifdef CONFIG_STM32H7_SPI2
  FAR struct spi_dev_s *spi2;
  
  spi2 = stm32_spibus_initialize(2);
  if (spi2)
    {
      ret = spi_register(spi2, 2);
      if (ret < 0)
        {
          syslog(LOG_ERR, "ERROR: Failed to register SPI2: %d\n", ret);
        }
      else
        {
          syslog(LOG_INFO, "SPI2 registered as /dev/spi2\n");
        }
    }
#endif

#ifdef CONFIG_STM32H7_SPI3
  FAR struct spi_dev_s *spi3;
  
  spi3 = stm32_spibus_initialize(3);
  if (spi3)
    {
      ret = spi_register(spi3, 3);
      if (ret < 0)
        {
          syslog(LOG_ERR, "ERROR: Failed to register SPI3: %d\n", ret);
        }
      else
        {
          syslog(LOG_INFO, "SPI3 registered as /dev/spi3\n");
        }
    }
#endif

