vrmay23/port_nucleo-h753zi/nuttx/boards/arm/stm32h7/nucleo-h753zi/src/drivers/driver_bus/stm32_spi_new.c
#ifdef CONFIG_STM32H7_SPI4
  FAR struct spi_dev_s *spi4;
  
  spi4 = stm32_spibus_initialize(4);
  if (spi4)
    {
      ret = spi_register(spi4, 4);
      if (ret < 0)
        {
          syslog(LOG_ERR, "ERROR: Failed to register SPI4: %d\n", ret);
        }
      else
        {
          syslog(LOG_INFO, "SPI4 registered as /dev/spi4\n");
        }
    }
#endif

#ifdef CONFIG_STM32H7_SPI5
  FAR struct spi_dev_s *spi5;
  
  spi5 = stm32_spibus_initialize(5);
  if (spi5)
    {
      ret = spi_register(spi5, 5);
      if (ret < 0)
        {
          syslog(LOG_ERR, "ERROR: Failed to register SPI5: %d\n", ret);
        }
      else
        {
          syslog(LOG_INFO, "SPI5 registered as /dev/spi5\n");
        }
    }
#endif

#ifdef CONFIG_STM32H7_SPI6
  FAR struct spi_dev_s *spi6;
  
  spi6 = stm32_spibus_initialize(6);
  if (spi6)
    {
      ret = spi_register(spi6, 6);
      if (ret < 0)
        {
          syslog(LOG_ERR, "ERROR: Failed to register SPI6: %d\n", ret);
        }
      else
        {
          syslog(LOG_INFO, "SPI6 registered as /dev/spi6\n");
        }
    }
#endif

  return ret;
}
#endif

/****************************************************************************
 * Name: get_dc_devices_array
 *
 * Description:
 *   Get DC devices array for a specific SPI bus.
 *
 * Input Parameters:
 *   spi_bus - SPI bus number (1-6)
 *
 * Returned Value:
 *   Pointer to DC devices array, NULL if invalid bus
 *
 ****************************************************************************/

#ifdef CONFIG_SPI_CMDDATA
static struct spi_dc_device_s *get_dc_devices_array(int spi_bus)
{
  switch (spi_bus)
    {
#ifdef CONFIG_STM32H7_SPI1
      case 1: return g_spi1_dc_devices;
#endif
#ifdef CONFIG_STM32H7_SPI2
      case 2: return g_spi2_dc_devices;
#endif
#ifdef CONFIG_STM32H7_SPI3
      case 3: return g_spi3_dc_devices;
#endif
#ifdef CONFIG_STM32H7_SPI4
      case 4: return g_spi4_dc_devices;
#endif
#ifdef CONFIG_STM32H7_SPI5
      case 5: return g_spi5_dc_devices;
#endif
#ifdef CONFIG_STM32H7_SPI6
      case 6: return g_spi6_dc_devices;
#endif
      default:
        return NULL;
    }
}

/****************************************************************************
 * Name: spi_dc_control
 *
 * Description:
 *   Control SPI DC (Data/Command) pin for registered device.
 *
 * Input Parameters:
 *   spi_bus - SPI bus number (1-6)
 *   devid   - Device ID within the bus
 *   cmd     - true = command mode, false = data mode
 *
 ****************************************************************************/

static void spi_dc_control(int spi_bus, uint32_t devid, bool cmd)
{
  struct spi_dc_device_s *dc_devices;
  struct spi_dc_device_s *device;
  uint32_t actual_devid = devid;

  dc_devices = get_dc_devices_array(spi_bus);
  if (dc_devices == NULL)
    {
      spierr("ERROR: Invalid SPI bus %d for DC control\n", spi_bus);
      return;
    }

  /* Handle SPIDEV_* types (extract device ID from lower 16 bits) */

  if ((devid & 0xFFFF0000) != 0)
    {
      actual_devid = (devid & 0x0000FFFF);
    }
  else if (devid >= MAX_CS_DEVICES_PER_SPI)
    {
      spierr("ERROR: Device ID %lu >= maximum %d for DC control on SPI%d\n",
             (unsigned long)devid, MAX_CS_DEVICES_PER_SPI, spi_bus);
      return;
    }

  device = &dc_devices[actual_devid];
  if (!device->in_use)
    {
      spierr("ERROR: DC pin not registered for SPI%d device %lu\n",
             spi_bus, (unsigned long)actual_devid);
      return;
    }

  /* Set DC pin: HIGH for command, LOW for data */

  stm32_gpiowrite(device->gpio_config, cmd);

  spiinfo("SPI%d DC%lu: %s (pin %s)\n",
          spi_bus, (unsigned long)actual_devid,
          cmd ? "COMMAND" : "DATA",
          cmd ? "HIGH" : "LOW");
}
#endif /* CONFIG_SPI_CMDDATA */

/****************************************************************************
 * Name: stm32_spi1/2/3/4/5/6_select
 *
 * Description:
 * SPI select functions for each interface - now uses registration system.
 *
 ****************************************************************************/

#ifdef CONFIG_STM32H7_SPI1
void stm32_spi1select(FAR struct spi_dev_s *dev, uint32_t devid,
                      bool selected)
{
  spiinfo("SPI1 CS: devid=%lu, %s\n",
          (unsigned long)devid, selected ? "SELECT" : "DESELECT");
  spi_cs_control(1, devid, selected);
}

uint8_t stm32_spi1status(FAR struct spi_dev_s *dev, uint32_t devid)
{
  return SPI_STATUS_PRESENT;
}

#ifdef CONFIG_SPI_CMDDATA
void stm32_spi1cmddata(FAR struct spi_dev_s *dev, uint32_t devid, bool cmd)
{
  spi_dc_control(1, devid, cmd);
}
#endif
#endif


#ifdef CONFIG_STM32H7_SPI2
void stm32_spi2select(FAR struct spi_dev_s *dev, uint32_t devid,
                      bool selected)
{
  spiinfo("SPI2 CS: devid=%lu, %s\n",
          (unsigned long)devid, selected ? "SELECT" : "DESELECT");
  spi_cs_control(2, devid, selected);
}

uint8_t stm32_spi2status(FAR struct spi_dev_s *dev, uint32_t devid)
{
  return SPI_STATUS_PRESENT;
}

#ifdef CONFIG_SPI_CMDDATA
void stm32_spi2cmddata(FAR struct spi_dev_s *dev, uint32_t devid, bool cmd)
{
  spi_dc_control(2, devid, cmd);
}
#endif
#endif

#ifdef CONFIG_STM32H7_SPI3
void stm32_spi3select(FAR struct spi_dev_s *dev, uint32_t devid,
                      bool selected)
{
  spiinfo("SPI3 CS: devid=%lu, %s\n",
          (unsigned long)devid, selected ? "SELECT" : "DESELECT");
  spi_cs_control(3, devid, selected);
}

uint8_t stm32_spi3status(FAR struct spi_dev_s *dev, uint32_t devid)
{
  return SPI_STATUS_PRESENT;
}

#ifdef CONFIG_SPI_CMDDATA
void stm32_spi3cmddata(FAR struct spi_dev_s *dev, uint32_t devid, bool cmd)
{
  spi_dc_control(3, devid, cmd);
}
#endif
#endif

#ifdef CONFIG_STM32H7_SPI4
void stm32_spi4select(FAR struct spi_dev_s *dev, uint32_t devid,
                      bool selected)
{
  spiinfo("SPI4 CS: devid=%lu, %s\n",
          (unsigned long)devid, selected ? "SELECT" : "DESELECT");
  spi_cs_control(4, devid, selected);
}

uint8_t stm32_spi4status(FAR struct spi_dev_s *dev, uint32_t devid)
{
  return SPI_STATUS_PRESENT;
}

#ifdef CONFIG_SPI_CMDDATA
void stm32_spi4cmddata(FAR struct spi_dev_s *dev, uint32_t devid, bool cmd)
{
  spi_dc_control(4, devid, cmd);
}
#endif
#endif

#ifdef CONFIG_STM32H7_SPI5
void stm32_spi5select(FAR struct spi_dev_s *dev, uint32_t devid,
                      bool selected)
{
  spiinfo("SPI5 CS: devid=%lu, %s\n",
          (unsigned long)devid, selected ? "SELECT" : "DESELECT");
  spi_cs_control(5, devid, selected);
}

uint8_t stm32_spi5status(FAR struct spi_dev_s *dev, uint32_t devid)
{
  return SPI_STATUS_PRESENT;
}

#ifdef CONFIG_SPI_CMDDATA
void stm32_spi5cmddata(FAR struct spi_dev_s *dev, uint32_t devid, bool cmd)
{
  spi_dc_control(5, devid, cmd);
}
#endif
#endif

#ifdef CONFIG_STM32H7_SPI6
void stm32_spi6select(FAR struct spi_dev_s *dev, uint32_t devid,
                      bool selected)
{
  spiinfo("SPI6 CS: devid=%lu, %s\n",
          (unsigned long)devid, selected ? "SELECT" : "DESELECT");
  spi_cs_control(6, devid, selected);
}

uint8_t stm32_spi6status(FAR struct spi_dev_s *dev, uint32_t devid)
{
  return SPI_STATUS_PRESENT;
}

#ifdef CONFIG_SPI_CMDDATA
void stm32_spi6cmddata(FAR struct spi_dev_s *dev, uint32_t devid, bool cmd)
{
  spi_dc_control(6, devid, cmd);
}
#endif
#endif

#endif /* CONFIG_STM32H7_SPI */
